test_sh/db_bench.txt
2024年 09月 11日 星期三 11:06:32 CST
./db_bench --db=/database_sdd/wisckeydb_dbbench_test --benchmarks=fillrandom,stats --num=100000000 --value_size=992 --threads=1 --histogram=1 >> db_bench.txt
Keys:       24 bytes each
Values:     992 bytes each (496 bytes after compression)
Entries:    100000000
RawSize:    96893.3 MB (estimated)
FileSize:   49591.1 MB (estimated)
------------------------------------------------
zc 
zc final cur_vlog = 1
zc vlog_numb = 1 invalid_count = 0
zc 
fillrandom   :       8.129 micros/op;  119.2 MB/s
Microseconds per op:
Count: 100000000  Average: 8.1287  StdDev: 1110.81
Min: 0.0000  Median: 1.9205  Max: 2300437.0000
------------------------------------------------------
[       0,       1 )    7994   0.008%   0.008% 
[       1,       2 ) 54308581  54.309%  54.317% ###########
[       2,       3 ) 35757578  35.758%  90.074% #######
[       3,       4 ) 8277396   8.277%  98.352% ##
[       4,       5 )  532006   0.532%  98.884% 
[       5,       6 )  180279   0.180%  99.064% 
[       6,       7 )  131426   0.131%  99.195% 
[       7,       8 )  136379   0.136%  99.332% 
[       8,       9 )   73483   0.073%  99.405% 
[       9,      10 )   29083   0.029%  99.434% 
[      10,      12 )   37834   0.038%  99.472% 
[      12,      14 )   42283   0.042%  99.514% 
[      14,      16 )    9487   0.009%  99.524% 
[      16,      18 )    4843   0.005%  99.529% 
[      18,      20 )    2491   0.002%  99.531% 
[      20,      25 )   34495   0.034%  99.566% 
[      25,      30 )   38136   0.038%  99.604% 
[      30,      35 )    1471   0.001%  99.605% 
[      35,      40 )     459   0.000%  99.606% 
[      40,      45 )     387   0.000%  99.606% 
[      45,      50 )     201   0.000%  99.606% 
[      50,      60 )     210   0.000%  99.607% 
[      60,      70 )     196   0.000%  99.607% 
[      70,      80 )     398   0.000%  99.607% 
[      80,      90 )     670   0.001%  99.608% 
[      90,     100 )     385   0.000%  99.608% 
[     100,     120 )     378   0.000%  99.609% 
[     120,     140 )     239   0.000%  99.609% 
[     140,     160 )     185   0.000%  99.609% 
[     160,     180 )     114   0.000%  99.609% 
[     180,     200 )      71   0.000%  99.609% 
[     200,     250 )     194   0.000%  99.609% 
[     250,     300 )     181   0.000%  99.610% 
[     300,     350 )     177   0.000%  99.610% 
[     350,     400 )     203   0.000%  99.610% 
[     400,     450 )      90   0.000%  99.610% 
[     450,     500 )      26   0.000%  99.610% 
[     500,     600 )      33   0.000%  99.610% 
[     600,     700 )      40   0.000%  99.610% 
[     700,     800 )      50   0.000%  99.610% 
[     800,     900 )      42   0.000%  99.610% 
[     900,    1000 )      35   0.000%  99.610% 
[    1000,    1200 )  381873   0.382%  99.992% 
[    1200,    1400 )    4357   0.004%  99.996% 
[    1400,    1600 )     136   0.000%  99.997% 
[    1600,    1800 )     143   0.000%  99.997% 
[    1800,    2000 )     128   0.000%  99.997% 
[    2000,    2500 )     270   0.000%  99.997% 
[    2500,    3000 )     161   0.000%  99.997% 
[    3000,    3500 )     138   0.000%  99.997% 
[    3500,    4000 )     135   0.000%  99.998% 
[    4000,    4500 )     113   0.000%  99.998% 
[    4500,    5000 )     103   0.000%  99.998% 
[    5000,    6000 )     117   0.000%  99.998% 
[    6000,    7000 )     103   0.000%  99.998% 
[    7000,    8000 )     102   0.000%  99.998% 
[    8000,    9000 )      75   0.000%  99.998% 
[    9000,   10000 )      70   0.000%  99.998% 
[   10000,   12000 )     134   0.000%  99.998% 
[   12000,   14000 )     101   0.000%  99.998% 
[   14000,   16000 )      95   0.000%  99.999% 
[   16000,   18000 )      58   0.000%  99.999% 
[   18000,   20000 )      81   0.000%  99.999% 
[   20000,   25000 )     146   0.000%  99.999% 
[   25000,   30000 )      78   0.000%  99.999% 
[   30000,   35000 )     103   0.000%  99.999% 
[   35000,   40000 )      68   0.000%  99.999% 
[   40000,   45000 )      57   0.000%  99.999% 
[   45000,   50000 )      52   0.000%  99.999% 
[   50000,   60000 )      64   0.000%  99.999% 
[   60000,   70000 )      77   0.000%  99.999% 
[   70000,   80000 )      58   0.000%  99.999% 
[   80000,   90000 )      37   0.000%  99.999% 
[   90000,  100000 )      38   0.000%  99.999% 
[  100000,  120000 )      54   0.000% 100.000% 
[  120000,  140000 )      62   0.000% 100.000% 
[  140000,  160000 )      42   0.000% 100.000% 
[  160000,  180000 )      33   0.000% 100.000% 
[  180000,  200000 )      12   0.000% 100.000% 
[  200000,  250000 )      52   0.000% 100.000% 
[  250000,  300000 )      46   0.000% 100.000% 
[  300000,  350000 )      31   0.000% 100.000% 
[  350000,  400000 )      28   0.000% 100.000% 
[  400000,  450000 )      24   0.000% 100.000% 
[  450000,  500000 )      20   0.000% 100.000% 
[  500000,  600000 )      30   0.000% 100.000% 
[  600000,  700000 )      23   0.000% 100.000% 
[  700000,  800000 )      16   0.000% 100.000% 
[  800000,  900000 )       8   0.000% 100.000% 
[  900000, 1000000 )      11   0.000% 100.000% 
[ 1000000, 1200000 )      12   0.000% 100.000% 
[ 1200000, 1400000 )       8   0.000% 100.000% 
[ 1400000, 1600000 )       3   0.000% 100.000% 
[ 1600000, 1800000 )       3   0.000% 100.000% 
[ 1800000, 2000000 )       1   0.000% 100.000% 
[ 2000000, 2500000 )       1   0.000% 100.000% 


                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        2        2       105        0      1586
  1       20       29       201     5248      5174
  2      127      204       296     8676      8556
  3      456      899        55     2934      2676
                               Gc
FileNumber   GcTime(mis) Read(MB) reWrite(MB)
--------------------------------------------------

zc final cur_vlog = 774
zc vlog_numb = 1 invalid_count = 72236
zc vlog_numb = 2 invalid_count = 71724
zc vlog_numb = 3 invalid_count = 71427
zc vlog_numb = 4 invalid_count = 71555
zc vlog_numb = 5 invalid_count = 71952
zc vlog_numb = 6 invalid_count = 71419
zc vlog_numb = 7 invalid_count = 71227
zc vlog_numb = 8 invalid_count = 71594
zc vlog_numb = 9 invalid_count = 71312
zc vlog_numb = 10 invalid_count = 71377
zc vlog_numb = 11 invalid_count = 71033
zc vlog_numb = 12 invalid_count = 70902
zc vlog_numb = 13 invalid_count = 71059
zc vlog_numb = 14 invalid_count = 70791
zc vlog_numb = 15 invalid_count = 70811
zc vlog_numb = 16 invalid_count = 70304
zc vlog_numb = 17 invalid_count = 70365
zc vlog_numb = 18 invalid_count = 70777
zc vlog_numb = 19 invalid_count = 70573
zc vlog_numb = 20 invalid_count = 70245
zc vlog_numb = 21 invalid_count = 70413
zc vlog_numb = 22 invalid_count = 70657
zc vlog_numb = 23 invalid_count = 69980
zc vlog_numb = 24 invalid_count = 70076
zc vlog_numb = 25 invalid_count = 69980
zc vlog_numb = 26 invalid_count = 70060
zc vlog_numb = 27 invalid_count = 69819
zc vlog_numb = 28 invalid_count = 69948
zc vlog_numb = 29 invalid_count = 69735
zc vlog_numb = 30 invalid_count = 70049
zc vlog_numb = 31 invalid_count = 69642
zc vlog_numb = 32 invalid_count = 69373
zc vlog_numb = 33 invalid_count = 69628
zc vlog_numb = 34 invalid_count = 69091
zc vlog_numb = 35 invalid_count = 69078
zc vlog_numb = 36 invalid_count = 69163
zc vlog_numb = 37 invalid_count = 69176
zc vlog_numb = 38 invalid_count = 69041
zc vlog_numb = 39 invalid_count = 69016
zc vlog_numb = 40 invalid_count = 68861
zc vlog_numb = 41 invalid_count = 68711
zc vlog_numb = 42 invalid_count = 68599
zc vlog_numb = 43 invalid_count = 68512
zc vlog_numb = 44 invalid_count = 68515
zc vlog_numb = 45 invalid_count = 68539
zc vlog_numb = 46 invalid_count = 68737
zc vlog_numb = 47 invalid_count = 68220
zc vlog_numb = 48 invalid_count = 68070
zc vlog_numb = 49 invalid_count = 68313
zc vlog_numb = 50 invalid_count = 67883
zc vlog_numb = 51 invalid_count = 68005
zc vlog_numb = 52 invalid_count = 67867
zc vlog_numb = 53 invalid_count = 67722
zc vlog_numb = 54 invalid_count = 68075
zc vlog_numb = 55 invalid_count = 67568
zc vlog_numb = 56 invalid_count = 67541
zc vlog_numb = 57 invalid_count = 67799
zc vlog_numb = 58 invalid_count = 67480
zc vlog_numb = 59 invalid_count = 67699
zc vlog_numb = 60 invalid_count = 67041
zc vlog_numb = 61 invalid_count = 67264
zc vlog_numb = 62 invalid_count = 67041
zc vlog_numb = 63 invalid_count = 67178
zc vlog_numb = 64 invalid_count = 66973
zc vlog_numb = 65 invalid_count = 67069
zc vlog_numb = 66 invalid_count = 66766
zc vlog_numb = 67 invalid_count = 66894
zc vlog_numb = 68 invalid_count = 66540
zc vlog_numb = 69 invalid_count = 66652
zc vlog_numb = 70 invalid_count = 66453
zc vlog_numb = 71 invalid_count = 66630
zc vlog_numb = 72 invalid_count = 66493
zc vlog_numb = 73 invalid_count = 66273
zc vlog_numb = 74 invalid_count = 65871
zc vlog_numb = 75 invalid_count = 65892
zc vlog_numb = 76 invalid_count = 66200
zc vlog_numb = 77 invalid_count = 65749
zc vlog_numb = 78 invalid_count = 65748
zc vlog_numb = 79 invalid_count = 65717
zc vlog_numb = 80 invalid_count = 65775
zc vlog_numb = 81 invalid_count = 65469
zc vlog_numb = 82 invalid_count = 65340
zc vlog_numb = 83 invalid_count = 65142
zc vlog_numb = 84 invalid_count = 65152
zc vlog_numb = 85 invalid_count = 65319
zc vlog_numb = 86 invalid_count = 65349
zc vlog_numb = 87 invalid_count = 65263
zc vlog_numb = 88 invalid_count = 65023
zc vlog_numb = 89 invalid_count = 65044
zc vlog_numb = 90 invalid_count = 64758
zc vlog_numb = 91 invalid_count = 64493
zc vlog_numb = 92 invalid_count = 64898
zc vlog_numb = 93 invalid_count = 64633
zc vlog_numb = 94 invalid_count = 64938
zc vlog_numb = 95 invalid_count = 64264
zc vlog_numb = 96 invalid_count = 64490
zc vlog_numb = 97 invalid_count = 64458
zc vlog_numb = 98 invalid_count = 64207
zc vlog_numb = 99 invalid_count = 64142
zc vlog_numb = 100 invalid_count = 64238
zc vlog_numb = 101 invalid_count = 63922
zc vlog_numb = 102 invalid_count = 63916
zc vlog_numb = 103 invalid_count = 64130
zc vlog_numb = 104 invalid_count = 63605
zc vlog_numb = 105 invalid_count = 63784
zc vlog_numb = 106 invalid_count = 63627
zc vlog_numb = 107 invalid_count = 63357
zc vlog_numb = 108 invalid_count = 63719
zc vlog_numb = 109 invalid_count = 63503
zc vlog_numb = 110 invalid_count = 63344
zc vlog_numb = 111 invalid_count = 63061
zc vlog_numb = 112 invalid_count = 63192
zc vlog_numb = 113 invalid_count = 63087
zc vlog_numb = 114 invalid_count = 62912
zc vlog_numb = 115 invalid_count = 62927
zc vlog_numb = 116 invalid_count = 62719
zc vlog_numb = 117 invalid_count = 62783
zc vlog_numb = 118 invalid_count = 62183
zc vlog_numb = 119 invalid_count = 62226
zc vlog_numb = 120 invalid_count = 62011
zc vlog_numb = 121 invalid_count = 62341
zc vlog_numb = 122 invalid_count = 62172
zc vlog_numb = 123 invalid_count = 62348
zc vlog_numb = 124 invalid_count = 61958
zc vlog_numb = 125 invalid_count = 62175
zc vlog_numb = 126 invalid_count = 62271
zc vlog_numb = 127 invalid_count = 61601
zc vlog_numb = 128 invalid_count = 61848
zc vlog_numb = 129 invalid_count = 61628
zc vlog_numb = 130 invalid_count = 61349
zc vlog_numb = 131 invalid_count = 61485
zc vlog_numb = 132 invalid_count = 61476
zc vlog_numb = 133 invalid_count = 61131
zc vlog_numb = 134 invalid_count = 61620
zc vlog_numb = 135 invalid_count = 60895
zc vlog_numb = 136 invalid_count = 61005
zc vlog_numb = 137 invalid_count = 60809
zc vlog_numb = 138 invalid_count = 60898
zc vlog_numb = 139 invalid_count = 60807
zc vlog_numb = 140 invalid_count = 60960
zc vlog_numb = 141 invalid_count = 60544
zc vlog_numb = 142 invalid_count = 59906
zc vlog_numb = 143 invalid_count = 60565
zc vlog_numb = 144 invalid_count = 60573
zc vlog_numb = 145 invalid_count = 59960
zc vlog_numb = 146 invalid_count = 60150
zc vlog_numb = 147 invalid_count = 60053
zc vlog_numb = 148 invalid_count = 59898
zc vlog_numb = 149 invalid_count = 59715
zc vlog_numb = 150 invalid_count = 59831
zc vlog_numb = 151 invalid_count = 59926
zc vlog_numb = 152 invalid_count = 59392
zc vlog_numb = 153 invalid_count = 59653
zc vlog_numb = 154 invalid_count = 59590
zc vlog_numb = 155 invalid_count = 59447
zc vlog_numb = 156 invalid_count = 59223
zc vlog_numb = 157 invalid_count = 59269
zc vlog_numb = 158 invalid_count = 59106
zc vlog_numb = 159 invalid_count = 59102
zc vlog_numb = 160 invalid_count = 58856
zc vlog_numb = 161 invalid_count = 59106
zc vlog_numb = 162 invalid_count = 58849
zc vlog_numb = 163 invalid_count = 58570
zc vlog_numb = 164 invalid_count = 58850
zc vlog_numb = 165 invalid_count = 58463
zc vlog_numb = 166 invalid_count = 58505
zc vlog_numb = 167 invalid_count = 58118
zc vlog_numb = 168 invalid_count = 58160
zc vlog_numb = 169 invalid_count = 57907
zc vlog_numb = 170 invalid_count = 58027
zc vlog_numb = 171 invalid_count = 57738
zc vlog_numb = 172 invalid_count = 58047
zc vlog_numb = 173 invalid_count = 57864
zc vlog_numb = 174 invalid_count = 57683
zc vlog_numb = 175 invalid_count = 57381
zc vlog_numb = 176 invalid_count = 57653
zc vlog_numb = 177 invalid_count = 57235
zc vlog_numb = 178 invalid_count = 57127
zc vlog_numb = 179 invalid_count = 57056
zc vlog_numb = 180 invalid_count = 57434
zc vlog_numb = 181 invalid_count = 57000
zc vlog_numb = 182 invalid_count = 56947
zc vlog_numb = 183 invalid_count = 57184
zc vlog_numb = 184 invalid_count = 56796
zc vlog_numb = 185 invalid_count = 56775
zc vlog_numb = 186 invalid_count = 56653
zc vlog_numb = 187 invalid_count = 56848
zc vlog_numb = 188 invalid_count = 56145
zc vlog_numb = 189 invalid_count = 56173
zc vlog_numb = 190 invalid_count = 56474
zc vlog_numb = 191 invalid_count = 56019
zc vlog_numb = 192 invalid_count = 55854
zc vlog_numb = 193 invalid_count = 55713
zc vlog_numb = 194 invalid_count = 55728
zc vlog_numb = 195 invalid_count = 55854
zc vlog_numb = 196 invalid_count = 55771
zc vlog_numb = 197 invalid_count = 55549
zc vlog_numb = 198 invalid_count = 55378
zc vlog_numb = 199 invalid_count = 55291
zc vlog_numb = 200 invalid_count = 55115
zc vlog_numb = 201 invalid_count = 55233
zc vlog_numb = 202 invalid_count = 55117
zc vlog_numb = 203 invalid_count = 55083
zc vlog_numb = 204 invalid_count = 54885
zc vlog_numb = 205 invalid_count = 54619
zc vlog_numb = 206 invalid_count = 54842
zc vlog_numb = 207 invalid_count = 54734
zc vlog_numb = 208 invalid_count = 54710
zc vlog_numb = 209 invalid_count = 54307
zc vlog_numb = 210 invalid_count = 53956
zc vlog_numb = 211 invalid_count = 54176
zc vlog_numb = 212 invalid_count = 54253
zc vlog_numb = 213 invalid_count = 53842
zc vlog_numb = 214 invalid_count = 54005
zc vlog_numb = 215 invalid_count = 53627
zc vlog_numb = 216 invalid_count = 53827
zc vlog_numb = 217 invalid_count = 53979
zc vlog_numb = 218 invalid_count = 53412
zc vlog_numb = 219 invalid_count = 53337
zc vlog_numb = 220 invalid_count = 53250
zc vlog_numb = 221 invalid_count = 53287
zc vlog_numb = 222 invalid_count = 53095
zc vlog_numb = 223 invalid_count = 53262
zc vlog_numb = 224 invalid_count = 53056
zc vlog_numb = 225 invalid_count = 52884
zc vlog_numb = 226 invalid_count = 52678
zc vlog_numb = 227 invalid_count = 52505
zc vlog_numb = 228 invalid_count = 52500
zc vlog_numb = 229 invalid_count = 52541
zc vlog_numb = 230 invalid_count = 52334
zc vlog_numb = 231 invalid_count = 52234
zc vlog_numb = 232 invalid_count = 52080
zc vlog_numb = 233 invalid_count = 52178
zc vlog_numb = 234 invalid_count = 52030
zc vlog_numb = 235 invalid_count = 52234
zc vlog_numb = 236 invalid_count = 51873
zc vlog_numb = 237 invalid_count = 51459
zc vlog_numb = 238 invalid_count = 51724
zc vlog_numb = 239 invalid_count = 51398
zc vlog_numb = 240 invalid_count = 51322
zc vlog_numb = 241 invalid_count = 51200
zc vlog_numb = 242 invalid_count = 50812
zc vlog_numb = 243 invalid_count = 51027
zc vlog_numb = 244 invalid_count = 51269
zc vlog_numb = 245 invalid_count = 50656
zc vlog_numb = 246 invalid_count = 50632
zc vlog_numb = 247 invalid_count = 50831
zc vlog_numb = 248 invalid_count = 50586
zc vlog_numb = 249 invalid_count = 50461
zc vlog_numb = 250 invalid_count = 50596
zc vlog_numb = 251 invalid_count = 50183
zc vlog_numb = 252 invalid_count = 50097
zc vlog_numb = 253 invalid_count = 50011
zc vlog_numb = 254 invalid_count = 49999
zc vlog_numb = 255 invalid_count = 49737
zc vlog_numb = 256 invalid_count = 50108
zc vlog_numb = 257 invalid_count = 49846
zc vlog_numb = 258 invalid_count = 49593
zc vlog_numb = 259 invalid_count = 49400
zc vlog_numb = 260 invalid_count = 49110
zc vlog_numb = 261 invalid_count = 48960
zc vlog_numb = 262 invalid_count = 49349
zc vlog_numb = 263 invalid_count = 48924
zc vlog_numb = 264 invalid_count = 48876
zc vlog_numb = 265 invalid_count = 49101
zc vlog_numb = 266 invalid_count = 48946
zc vlog_numb = 267 invalid_count = 48537
zc vlog_numb = 268 invalid_count = 48355
zc vlog_numb = 269 invalid_count = 48241
zc vlog_numb = 270 invalid_count = 48316
zc vlog_numb = 271 invalid_count = 48135
zc vlog_numb = 272 invalid_count = 48249
zc vlog_numb = 273 invalid_count = 48067
zc vlog_numb = 274 invalid_count = 47948
zc vlog_numb = 275 invalid_count = 47719
zc vlog_numb = 276 invalid_count = 47719
zc vlog_numb = 277 invalid_count = 47575
zc vlog_numb = 278 invalid_count = 47533
zc vlog_numb = 279 invalid_count = 47196
zc vlog_numb = 280 invalid_count = 47210
zc vlog_numb = 281 invalid_count = 47173
zc vlog_numb = 282 invalid_count = 47043
zc vlog_numb = 283 invalid_count = 47106
zc vlog_numb = 284 invalid_count = 47149
zc vlog_numb = 285 invalid_count = 46732
zc vlog_numb = 286 invalid_count = 46714
zc vlog_numb = 287 invalid_count = 46552
zc vlog_numb = 288 invalid_count = 46656
zc vlog_numb = 289 invalid_count = 46648
zc vlog_numb = 290 invalid_count = 46278
zc vlog_numb = 291 invalid_count = 46238
zc vlog_numb = 292 invalid_count = 46387
zc vlog_numb = 293 invalid_count = 46022
zc vlog_numb = 294 invalid_count = 45858
zc vlog_numb = 295 invalid_count = 45811
zc vlog_numb = 296 invalid_count = 45537
zc vlog_numb = 297 invalid_count = 45516
zc vlog_numb = 298 invalid_count = 45737
zc vlog_numb = 299 invalid_count = 45448
zc vlog_numb = 300 invalid_count = 45224
zc vlog_numb = 301 invalid_count = 45022
zc vlog_numb = 302 invalid_count = 45095
zc vlog_numb = 303 invalid_count = 44685
zc vlog_numb = 304 invalid_count = 44800
zc vlog_numb = 305 invalid_count = 44591
zc vlog_numb = 306 invalid_count = 44643
zc vlog_numb = 307 invalid_count = 44460
zc vlog_numb = 308 invalid_count = 44458
zc vlog_numb = 309 invalid_count = 44466
zc vlog_numb = 310 invalid_count = 44279
zc vlog_numb = 311 invalid_count = 43936
zc vlog_numb = 312 invalid_count = 44123
zc vlog_numb = 313 invalid_count = 43772
zc vlog_numb = 314 invalid_count = 43628
zc vlog_numb = 315 invalid_count = 43803
zc vlog_numb = 316 invalid_count = 43391
zc vlog_numb = 317 invalid_count = 43219
zc vlog_numb = 318 invalid_count = 42988
zc vlog_numb = 319 invalid_count = 43189
zc vlog_numb = 320 invalid_count = 43354
zc vlog_numb = 321 invalid_count = 43252
zc vlog_numb = 322 invalid_count = 42945
zc vlog_numb = 323 invalid_count = 42708
zc vlog_numb = 324 invalid_count = 42544
zc vlog_numb = 325 invalid_count = 42528
zc vlog_numb = 326 invalid_count = 42521
zc vlog_numb = 327 invalid_count = 42058
zc vlog_numb = 328 invalid_count = 42243
zc vlog_numb = 329 invalid_count = 42455
zc vlog_numb = 330 invalid_count = 42080
zc vlog_numb = 331 invalid_count = 41925
zc vlog_numb = 332 invalid_count = 41905
zc vlog_numb = 333 invalid_count = 41785
zc vlog_numb = 334 invalid_count = 41635
zc vlog_numb = 335 invalid_count = 41551
zc vlog_numb = 336 invalid_count = 41195
zc vlog_numb = 337 invalid_count = 41571
zc vlog_numb = 338 invalid_count = 40749
zc vlog_numb = 339 invalid_count = 41135
zc vlog_numb = 340 invalid_count = 40592
zc vlog_numb = 341 invalid_count = 40800
zc vlog_numb = 342 invalid_count = 40788
zc vlog_numb = 343 invalid_count = 40510
zc vlog_numb = 344 invalid_count = 40383
zc vlog_numb = 345 invalid_count = 40512
zc vlog_numb = 346 invalid_count = 39872
zc vlog_numb = 347 invalid_count = 40425
zc vlog_numb = 348 invalid_count = 40031
zc vlog_numb = 349 invalid_count = 40004
zc vlog_numb = 350 invalid_count = 39801
zc vlog_numb = 351 invalid_count = 39628
zc vlog_numb = 352 invalid_count = 39511
zc vlog_numb = 353 invalid_count = 39564
zc vlog_numb = 354 invalid_count = 39746
zc vlog_numb = 355 invalid_count = 39255
zc vlog_numb = 356 invalid_count = 39172
zc vlog_numb = 357 invalid_count = 39277
zc vlog_numb = 358 invalid_count = 39061
zc vlog_numb = 359 invalid_count = 38668
zc vlog_numb = 360 invalid_count = 38534
zc vlog_numb = 361 invalid_count = 38368
zc vlog_numb = 362 invalid_count = 38386
zc vlog_numb = 363 invalid_count = 38109
zc vlog_numb = 364 invalid_count = 38289
zc vlog_numb = 365 invalid_count = 38052
zc vlog_numb = 366 invalid_count = 38181
zc vlog_numb = 367 invalid_count = 37979
zc vlog_numb = 368 invalid_count = 37812
zc vlog_numb = 369 invalid_count = 37607
zc vlog_numb = 370 invalid_count = 37536
zc vlog_numb = 371 invalid_count = 37419
zc vlog_numb = 372 invalid_count = 37074
zc vlog_numb = 373 invalid_count = 37312
zc vlog_numb = 374 invalid_count = 36988
zc vlog_numb = 375 invalid_count = 36654
zc vlog_numb = 376 invalid_count = 37042
zc vlog_numb = 377 invalid_count = 36422
zc vlog_numb = 378 invalid_count = 36376
zc vlog_numb = 379 invalid_count = 36174
zc vlog_numb = 380 invalid_count = 36271
zc vlog_numb = 381 invalid_count = 36328
zc vlog_numb = 382 invalid_count = 35927
zc vlog_numb = 383 invalid_count = 35810
zc vlog_numb = 384 invalid_count = 35744
zc vlog_numb = 385 invalid_count = 35654
zc vlog_numb = 386 invalid_count = 35610
zc vlog_numb = 387 invalid_count = 35396
zc vlog_numb = 388 invalid_count = 35550
zc vlog_numb = 389 invalid_count = 35236
zc vlog_numb = 390 invalid_count = 35115
zc vlog_numb = 391 invalid_count = 35014
zc vlog_numb = 392 invalid_count = 34652
zc vlog_numb = 393 invalid_count = 35005
zc vlog_numb = 394 invalid_count = 34772
zc vlog_numb = 395 invalid_count = 34526
zc vlog_numb = 396 invalid_count = 34459
zc vlog_numb = 397 invalid_count = 34458
zc vlog_numb = 398 invalid_count = 34219
zc vlog_numb = 399 invalid_count = 34089
zc vlog_numb = 400 invalid_count = 34027
zc vlog_numb = 401 invalid_count = 33876
zc vlog_numb = 402 invalid_count = 33649
zc vlog_numb = 403 invalid_count = 33584
zc vlog_numb = 404 invalid_count = 33508
zc vlog_numb = 405 invalid_count = 33215
zc vlog_numb = 406 invalid_count = 33456
zc vlog_numb = 407 invalid_count = 32996
zc vlog_numb = 408 invalid_count = 33209
zc vlog_numb = 409 invalid_count = 32959
zc vlog_numb = 410 invalid_count = 32813
zc vlog_numb = 411 invalid_count = 32528
zc vlog_numb = 412 invalid_count = 32492
zc vlog_numb = 413 invalid_count = 32253
zc vlog_numb = 414 invalid_count = 32391
zc vlog_numb = 415 invalid_count = 32132
zc vlog_numb = 416 invalid_count = 31756
zc vlog_numb = 417 invalid_count = 31994
zc vlog_numb = 418 invalid_count = 31781
zc vlog_numb = 419 invalid_count = 31726
zc vlog_numb = 420 invalid_count = 31321
zc vlog_numb = 421 invalid_count = 31196
zc vlog_numb = 422 invalid_count = 31458
zc vlog_numb = 423 invalid_count = 31175
zc vlog_numb = 424 invalid_count = 30787
zc vlog_numb = 425 invalid_count = 30876
zc vlog_numb = 426 invalid_count = 30694
zc vlog_numb = 427 invalid_count = 30637
zc vlog_numb = 428 invalid_count = 30513
zc vlog_numb = 429 invalid_count = 30284
zc vlog_numb = 430 invalid_count = 30423
zc vlog_numb = 431 invalid_count = 30375
zc vlog_numb = 432 invalid_count = 30102
zc vlog_numb = 433 invalid_count = 30032
zc vlog_numb = 434 invalid_count = 29856
zc vlog_numb = 435 invalid_count = 30215
zc vlog_numb = 436 invalid_count = 29653
zc vlog_numb = 437 invalid_count = 29607
zc vlog_numb = 438 invalid_count = 29621
zc vlog_numb = 439 invalid_count = 29276
zc vlog_numb = 440 invalid_count = 29122
zc vlog_numb = 441 invalid_count = 28883
zc vlog_numb = 442 invalid_count = 28566
zc vlog_numb = 443 invalid_count = 28656
zc vlog_numb = 444 invalid_count = 28761
zc vlog_numb = 445 invalid_count = 28543
zc vlog_numb = 446 invalid_count = 28313
zc vlog_numb = 447 invalid_count = 28264
zc vlog_numb = 448 invalid_count = 28122
zc vlog_numb = 449 invalid_count = 27966
zc vlog_numb = 450 invalid_count = 28140
zc vlog_numb = 451 invalid_count = 27761
zc vlog_numb = 452 invalid_count = 27335
zc vlog_numb = 453 invalid_count = 27478
zc vlog_numb = 454 invalid_count = 27336
zc vlog_numb = 455 invalid_count = 27178
zc vlog_numb = 456 invalid_count = 27156
zc vlog_numb = 457 invalid_count = 26746
zc vlog_numb = 458 invalid_count = 26807
zc vlog_numb = 459 invalid_count = 26799
zc vlog_numb = 460 invalid_count = 26517
zc vlog_numb = 461 invalid_count = 26413
zc vlog_numb = 462 invalid_count = 26219
zc vlog_numb = 463 invalid_count = 26132
zc vlog_numb = 464 invalid_count = 26045
zc vlog_numb = 465 invalid_count = 25923
zc vlog_numb = 466 invalid_count = 25651
zc vlog_numb = 467 invalid_count = 25639
zc vlog_numb = 468 invalid_count = 25435
zc vlog_numb = 469 invalid_count = 25537
zc vlog_numb = 470 invalid_count = 25638
zc vlog_numb = 471 invalid_count = 25189
zc vlog_numb = 472 invalid_count = 25079
zc vlog_numb = 473 invalid_count = 24860
zc vlog_numb = 474 invalid_count = 24847
zc vlog_numb = 475 invalid_count = 24722
zc vlog_numb = 476 invalid_count = 24662
zc vlog_numb = 477 invalid_count = 24307
zc vlog_numb = 478 invalid_count = 24167
zc vlog_numb = 479 invalid_count = 24004
zc vlog_numb = 480 invalid_count = 23796
zc vlog_numb = 481 invalid_count = 23610
zc vlog_numb = 482 invalid_count = 23718
zc vlog_numb = 483 invalid_count = 23523
zc vlog_numb = 484 invalid_count = 23596
zc vlog_numb = 485 invalid_count = 23418
zc vlog_numb = 486 invalid_count = 23314
zc vlog_numb = 487 invalid_count = 22926
zc vlog_numb = 488 invalid_count = 22934
zc vlog_numb = 489 invalid_count = 22625
zc vlog_numb = 490 invalid_count = 22666
zc vlog_numb = 491 invalid_count = 22511
zc vlog_numb = 492 invalid_count = 22162
zc vlog_numb = 493 invalid_count = 22105
zc vlog_numb = 494 invalid_count = 22197
zc vlog_numb = 495 invalid_count = 21663
zc vlog_numb = 496 invalid_count = 21798
zc vlog_numb = 497 invalid_count = 21612
zc vlog_numb = 498 invalid_count = 21722
zc vlog_numb = 499 invalid_count = 21335
zc vlog_numb = 500 invalid_count = 21314
zc vlog_numb = 501 invalid_count = 21328
zc vlog_numb = 502 invalid_count = 21023
zc vlog_numb = 503 invalid_count = 21078
zc vlog_numb = 504 invalid_count = 20566
zc vlog_numb = 505 invalid_count = 20452
zc vlog_numb = 506 invalid_count = 20768
zc vlog_numb = 507 invalid_count = 20331
zc vlog_numb = 508 invalid_count = 20283
zc vlog_numb = 509 invalid_count = 19932
zc vlog_numb = 510 invalid_count = 19957
zc vlog_numb = 511 invalid_count = 19659
zc vlog_numb = 512 invalid_count = 19697
zc vlog_numb = 513 invalid_count = 19762
zc vlog_numb = 514 invalid_count = 19625
zc vlog_numb = 515 invalid_count = 19198
zc vlog_numb = 516 invalid_count = 18953
zc vlog_numb = 517 invalid_count = 19167
zc vlog_numb = 518 invalid_count = 18811
zc vlog_numb = 519 invalid_count = 18508
zc vlog_numb = 520 invalid_count = 18693
zc vlog_numb = 521 invalid_count = 18174
zc vlog_numb = 522 invalid_count = 18298
zc vlog_numb = 523 invalid_count = 18012
zc vlog_numb = 524 invalid_count = 18239
zc vlog_numb = 525 invalid_count = 17795
zc vlog_numb = 526 invalid_count = 17744
zc vlog_numb = 527 invalid_count = 17412
zc vlog_numb = 528 invalid_count = 17392
zc vlog_numb = 529 invalid_count = 17565
zc vlog_numb = 530 invalid_count = 17126
zc vlog_numb = 531 invalid_count = 17054
zc vlog_numb = 532 invalid_count = 16946
zc vlog_numb = 533 invalid_count = 16858
zc vlog_numb = 534 invalid_count = 17066
zc vlog_numb = 535 invalid_count = 16928
zc vlog_numb = 536 invalid_count = 16623
zc vlog_numb = 537 invalid_count = 16601
zc vlog_numb = 538 invalid_count = 16441
zc vlog_numb = 539 invalid_count = 16288
zc vlog_numb = 540 invalid_count = 16037
zc vlog_numb = 541 invalid_count = 15772
zc vlog_numb = 542 invalid_count = 15979
zc vlog_numb = 543 invalid_count = 15802
zc vlog_numb = 544 invalid_count = 15670
zc vlog_numb = 545 invalid_count = 15518
zc vlog_numb = 546 invalid_count = 15133
zc vlog_numb = 547 invalid_count = 15253
zc vlog_numb = 548 invalid_count = 14964
zc vlog_numb = 549 invalid_count = 15098
zc vlog_numb = 550 invalid_count = 14714
zc vlog_numb = 551 invalid_count = 14617
zc vlog_numb = 552 invalid_count = 14796
zc vlog_numb = 553 invalid_count = 14387
zc vlog_numb = 554 invalid_count = 15210
zc vlog_numb = 555 invalid_count = 15570
zc vlog_numb = 556 invalid_count = 15356
zc vlog_numb = 557 invalid_count = 15208
zc vlog_numb = 558 invalid_count = 16766
zc vlog_numb = 559 invalid_count = 17583
zc vlog_numb = 560 invalid_count = 17262
zc vlog_numb = 561 invalid_count = 17303
zc vlog_numb = 562 invalid_count = 17638
zc vlog_numb = 563 invalid_count = 17830
zc vlog_numb = 564 invalid_count = 17731
zc vlog_numb = 565 invalid_count = 17353
zc vlog_numb = 566 invalid_count = 17306
zc vlog_numb = 567 invalid_count = 16971
zc vlog_numb = 568 invalid_count = 16981
zc vlog_numb = 569 invalid_count = 17115
zc vlog_numb = 570 invalid_count = 16610
zc vlog_numb = 571 invalid_count = 16568
zc vlog_numb = 572 invalid_count = 16478
zc vlog_numb = 573 invalid_count = 16222
zc vlog_numb = 574 invalid_count = 16345
zc vlog_numb = 575 invalid_count = 16044
zc vlog_numb = 576 invalid_count = 15916
zc vlog_numb = 577 invalid_count = 15896
zc vlog_numb = 578 invalid_count = 15405
zc vlog_numb = 579 invalid_count = 15284
zc vlog_numb = 580 invalid_count = 15289
zc vlog_numb = 581 invalid_count = 15010
zc vlog_numb = 582 invalid_count = 15177
zc vlog_numb = 583 invalid_count = 14892
zc vlog_numb = 584 invalid_count = 14866
zc vlog_numb = 585 invalid_count = 14573
zc vlog_numb = 586 invalid_count = 14688
zc vlog_numb = 587 invalid_count = 14289
zc vlog_numb = 588 invalid_count = 14284
zc vlog_numb = 589 invalid_count = 14125
zc vlog_numb = 590 invalid_count = 14604
zc vlog_numb = 591 invalid_count = 15961
zc vlog_numb = 592 invalid_count = 16015
zc vlog_numb = 593 invalid_count = 15696
zc vlog_numb = 594 invalid_count = 15586
zc vlog_numb = 595 invalid_count = 16840
zc vlog_numb = 596 invalid_count = 16711
zc vlog_numb = 597 invalid_count = 16529
zc vlog_numb = 598 invalid_count = 16470
zc vlog_numb = 599 invalid_count = 16147
zc vlog_numb = 600 invalid_count = 16136
zc vlog_numb = 601 invalid_count = 15932
zc vlog_numb = 602 invalid_count = 15771
zc vlog_numb = 603 invalid_count = 15625
zc vlog_numb = 604 invalid_count = 15746
zc vlog_numb = 605 invalid_count = 15680
zc vlog_numb = 606 invalid_count = 15303
zc vlog_numb = 607 invalid_count = 15057
zc vlog_numb = 608 invalid_count = 14958
zc vlog_numb = 609 invalid_count = 14866
zc vlog_numb = 610 invalid_count = 14643
zc vlog_numb = 611 invalid_count = 14576
zc vlog_numb = 612 invalid_count = 14555
zc vlog_numb = 613 invalid_count = 14132
zc vlog_numb = 614 invalid_count = 14226
zc vlog_numb = 615 invalid_count = 14114
zc vlog_numb = 616 invalid_count = 13875
zc vlog_numb = 617 invalid_count = 13817
zc vlog_numb = 618 invalid_count = 13402
zc vlog_numb = 619 invalid_count = 13549
zc vlog_numb = 620 invalid_count = 14051
zc vlog_numb = 621 invalid_count = 13747
zc vlog_numb = 622 invalid_count = 13784
zc vlog_numb = 623 invalid_count = 14091
zc vlog_numb = 624 invalid_count = 14860
zc vlog_numb = 625 invalid_count = 14625
zc vlog_numb = 626 invalid_count = 14533
zc vlog_numb = 627 invalid_count = 14217
zc vlog_numb = 628 invalid_count = 14508
zc vlog_numb = 629 invalid_count = 14229
zc vlog_numb = 630 invalid_count = 13820
zc vlog_numb = 631 invalid_count = 13870
zc vlog_numb = 632 invalid_count = 13467
zc vlog_numb = 633 invalid_count = 13509
zc vlog_numb = 634 invalid_count = 13329
zc vlog_numb = 635 invalid_count = 13421
zc vlog_numb = 636 invalid_count = 13242
zc vlog_numb = 637 invalid_count = 12871
zc vlog_numb = 638 invalid_count = 12739
zc vlog_numb = 639 invalid_count = 12928
zc vlog_numb = 640 invalid_count = 12344
zc vlog_numb = 641 invalid_count = 12498
zc vlog_numb = 642 invalid_count = 12250
zc vlog_numb = 643 invalid_count = 12230
zc vlog_numb = 644 invalid_count = 11877
zc vlog_numb = 645 invalid_count = 11924
zc vlog_numb = 646 invalid_count = 11575
zc vlog_numb = 647 invalid_count = 11513
zc vlog_numb = 648 invalid_count = 11559
zc vlog_numb = 649 invalid_count = 11497
zc vlog_numb = 650 invalid_count = 11167
zc vlog_numb = 651 invalid_count = 11029
zc vlog_numb = 652 invalid_count = 11875
zc vlog_numb = 653 invalid_count = 12037
zc vlog_numb = 654 invalid_count = 11876
zc vlog_numb = 655 invalid_count = 11788
zc vlog_numb = 656 invalid_count = 11640
zc vlog_numb = 657 invalid_count = 11966
zc vlog_numb = 658 invalid_count = 11959
zc vlog_numb = 659 invalid_count = 11682
zc vlog_numb = 660 invalid_count = 11529
zc vlog_numb = 661 invalid_count = 11294
zc vlog_numb = 662 invalid_count = 11249
zc vlog_numb = 663 invalid_count = 11037
zc vlog_numb = 664 invalid_count = 10897
zc vlog_numb = 665 invalid_count = 10756
zc vlog_numb = 666 invalid_count = 10452
zc vlog_numb = 667 invalid_count = 10432
zc vlog_numb = 668 invalid_count = 10429
zc vlog_numb = 669 invalid_count = 10125
zc vlog_numb = 670 invalid_count = 10055
zc vlog_numb = 671 invalid_count = 9977
zc vlog_numb = 672 invalid_count = 9688
zc vlog_numb = 673 invalid_count = 9529
zc vlog_numb = 674 invalid_count = 9334
zc vlog_numb = 675 invalid_count = 9309
zc vlog_numb = 676 invalid_count = 9177
zc vlog_numb = 677 invalid_count = 9142
zc vlog_numb = 678 invalid_count = 9008
zc vlog_numb = 679 invalid_count = 8612
zc vlog_numb = 680 invalid_count = 9636
zc vlog_numb = 681 invalid_count = 9739
zc vlog_numb = 682 invalid_count = 9402
zc vlog_numb = 683 invalid_count = 9334
zc vlog_numb = 684 invalid_count = 9254
zc vlog_numb = 685 invalid_count = 9158
zc vlog_numb = 686 invalid_count = 9107
zc vlog_numb = 687 invalid_count = 8900
zc vlog_numb = 688 invalid_count = 8610
zc vlog_numb = 689 invalid_count = 8544
zc vlog_numb = 690 invalid_count = 8473
zc vlog_numb = 691 invalid_count = 8310
zc vlog_numb = 692 invalid_count = 8114
zc vlog_numb = 693 invalid_count = 7941
zc vlog_numb = 694 invalid_count = 7874
zc vlog_numb = 695 invalid_count = 7612
zc vlog_numb = 696 invalid_count = 7424
zc vlog_numb = 697 invalid_count = 7350
zc vlog_numb = 698 invalid_count = 7276
zc vlog_numb = 699 invalid_count = 7103
zc vlog_numb = 700 invalid_count = 6870
zc vlog_numb = 701 invalid_count = 6788
zc vlog_numb = 702 invalid_count = 6505
zc vlog_numb = 703 invalid_count = 6342
zc vlog_numb = 704 invalid_count = 6289
zc vlog_numb = 705 invalid_count = 6057
zc vlog_numb = 706 invalid_count = 5908
zc vlog_numb = 707 invalid_count = 5853
zc vlog_numb = 708 invalid_count = 6210
zc vlog_numb = 709 invalid_count = 6062
zc vlog_numb = 710 invalid_count = 5929
zc vlog_numb = 711 invalid_count = 5845
zc vlog_numb = 712 invalid_count = 6375
zc vlog_numb = 713 invalid_count = 6322
zc vlog_numb = 714 invalid_count = 6298
zc vlog_numb = 715 invalid_count = 6177
zc vlog_numb = 716 invalid_count = 5757
zc vlog_numb = 717 invalid_count = 5729
zc vlog_numb = 718 invalid_count = 5509
zc vlog_numb = 719 invalid_count = 5321
zc vlog_numb = 720 invalid_count = 5310
zc vlog_numb = 721 invalid_count = 5054
zc vlog_numb = 722 invalid_count = 4973
zc vlog_numb = 723 invalid_count = 4764
zc vlog_numb = 724 invalid_count = 4707
zc vlog_numb = 725 invalid_count = 4524
zc vlog_numb = 726 invalid_count = 4216
zc vlog_numb = 727 invalid_count = 4210
zc vlog_numb = 728 invalid_count = 4006
zc vlog_numb = 729 invalid_count = 3806
zc vlog_numb = 730 invalid_count = 3689
zc vlog_numb = 731 invalid_count = 3662
zc vlog_numb = 732 invalid_count = 3432
zc vlog_numb = 733 invalid_count = 3217
zc vlog_numb = 734 invalid_count = 3116
zc vlog_numb = 735 invalid_count = 3047
zc vlog_numb = 736 invalid_count = 2749
zc vlog_numb = 737 invalid_count = 2735
zc vlog_numb = 738 invalid_count = 2519
zc vlog_numb = 739 invalid_count = 2325
zc vlog_numb = 740 invalid_count = 2400
zc vlog_numb = 741 invalid_count = 2314
zc vlog_numb = 742 invalid_count = 2143
zc vlog_numb = 743 invalid_count = 1961
zc vlog_numb = 744 invalid_count = 2003
zc vlog_numb = 745 invalid_count = 2101
zc vlog_numb = 746 invalid_count = 1860
zc vlog_numb = 747 invalid_count = 1725
zc vlog_numb = 748 invalid_count = 1707
zc vlog_numb = 749 invalid_count = 2102
zc vlog_numb = 750 invalid_count = 1937
zc vlog_numb = 751 invalid_count = 1807
zc vlog_numb = 752 invalid_count = 1787
zc vlog_numb = 753 invalid_count = 2184
zc vlog_numb = 754 invalid_count = 1990
zc vlog_numb = 755 invalid_count = 1870
zc vlog_numb = 756 invalid_count = 1819
zc vlog_numb = 757 invalid_count = 1806
zc vlog_numb = 758 invalid_count = 1730
zc vlog_numb = 759 invalid_count = 1453
zc vlog_numb = 760 invalid_count = 1457
zc vlog_numb = 761 invalid_count = 1400
zc vlog_numb = 762 invalid_count = 1346
zc vlog_numb = 763 invalid_count = 1095
zc vlog_numb = 764 invalid_count = 1150
zc vlog_numb = 765 invalid_count = 1070
zc vlog_numb = 766 invalid_count = 881
zc vlog_numb = 767 invalid_count = 789
zc vlog_numb = 768 invalid_count = 662
zc vlog_numb = 769 invalid_count = 464
zc vlog_numb = 770 invalid_count = 323
zc vlog_numb = 771 invalid_count = 186
zc vlog_numb = 772 invalid_count = 36
zc vlog_numb = 773 invalid_count = 0
zc vlog_numb = 774 invalid_count = 0